app/Http/Controllers/FaizCobaController.php

select * from `levels` where `level_weight` < 90 and `levels`.`deleted_at` is null
---
    public function index($rspMsg = null)
    {
        $levels = Level::where('level_weight', '<', 90)->get();

select * from `levels` where `id` != 4 and `level_name` = 'Level 1' and `deleted_at` is null and `levels`.`deleted_at` is null
select * from `levels` where `id` != 4 and `level_weight` = '1' and `deleted_at` is null and `levels`.`deleted_at` is null
select * from `levels` where (`id` = 4) and `levels`.`deleted_at` is null limit 1
update `levels` set `level_name` = 'Level 1', `levels`.`updated_at` = '2023-08-29 16:28:31' where `id` = 4
---
    public function store(Request $request)
    {
        //dd($request);
        try {
            $id = decrypt($request->id);

            //logic test
            $cek = Level::where('id', '!=', $id)->where('level_name', $request->level_name)->where('deleted_at', null)->get();
            if ($cek->count() > 0) {
                throw new Exception('Level dengan nama ' . $request->level_name . ' sudah ada');
            }

            $cek = Level::where('id', '!=', $id)->where('level_weight', $request->level_weight)->where('deleted_at', null)->get();
            if ($cek->count() > 0) {
                throw new Exception('Level dengan weight ' . $request->level_weight . ' sudah ada');
            }

            $request->validate([
                'level_name' => 'required',
                'level_weight' => 'required',
            ]);

            Level::updateOrCreate(
                ['id' => $id],
                $request->all(),
            );

select * from `levels` where `levels`.`id` = '4' and `levels`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        if ($id == null) {
            return abort(404);
        }
        $obj = Level::find($id);