app/Http/Controllers/HomeItemController.php

        try {
            $id = decrypt($request->id);
            $cek = HomeItem::where('title', $request->title)->where('id', '!=', $id)->where('deleted_at', null)->get();
            if ($cek->count() > 0) {
---
select * from `home_items` where (`id` is null) and `home_items`.`deleted_at` is null limit 1