app/Http/Controllers/HomeItemController.php

    public function index($rspMsg = null)
    {
        $home_items = HomeItem::all();
---
select * from `home_items` where `home_items`.`deleted_at` is null

            ]);

            //logic test
            $cek = HomeItem::where('title', $request->title)->where('id', '!=', $id)->where('deleted_at', null)->get();
---
select * from `home_items` where `title` = 'Coba' and `id` is not null and `deleted_at` is null and `home_items`.`deleted_at` is null

                throw new Exception('Home Item dengan title ' . $request->title . ' sudah ada');
            }

            $cek = HomeItem::where('content', $request->content)->where('id', '!=', $id)->where('deleted_at', null)->get();
---
select * from `home_items` where `content` = '<p>a&nbsp;</p>' and `id` is not null and `deleted_at` is null and `home_items`.`deleted_at` is null

                $dir = '/img/home_item/';
                $fileName = $imageData->hashName();
                if ($id > 0) {
                    $oldImageName = HomeItem::find($id)->image;
---
select * from `home_items` where `home_items`.`id` = 9 and `home_items`.`deleted_at` is null limit 1

            }

            //create post
            HomeItem::updateOrCreate(
                ['id' => $id],
                $obj,
            );
---
update `home_items` set `content` = '<p>Maiores dolor dolore ea sed qui atque possimus soluta hic ut vel vel rem natus nisi recusandae quam voluptatem cupiditate.</p>', `image` = 'Gy6QQfuibxcU4WU744OlJRMgXhu4MJUrZgr5CW4M.jpg', `home_items`.`updated_at` = '2023-09-01 22:01:50' where `id` = 1

    public function edit($id)
    {
        if ($id == null) {
            return abort(400);
        }

        $obj = HomeItem::find($id);
---
select * from `home_items` where `home_items`.`id` = '1' and `home_items`.`deleted_at` is null limit 1

    public function destroy($id)
    {
        try {
            $obj = HomeItem::find($id);
            if ($obj == null) {
                throw new Exception("Item not found. Fail deleting data");
            }
            //Storage::disk('local')->delete('public/img/' . $obj->image); //image tidak dihapus agar bisa di-restore..
            $obj->delete();
---
select * from `home_items` where `home_items`.`id` = '5' and `home_items`.`deleted_at` is null limit 1
update `home_items` set `deleted_at` = '2023-09-01 21:12:30', `home_items`.`updated_at` = '2023-09-01 21:12:30' where `id` = 5