app/Http/Controllers/LevelController.php

    public function edit($id)
    {
        if ($id == null) {
            return abort(400);
        }

        $obj = Level::find($id);
---
select * from `levels` where `levels`.`id` = '1' and `levels`.`deleted_at` is null limit 1