app/Http/Controllers/QuestionController.php

select * from `questions` where `question_key` = 'qZQAiWNGGQZpiSlq' and `questions`.`deleted_at` is null limit 1
---
    public function destroy($key)
    {
        if ($key == null) {
            return abort(400);
        }
        $obj = Question::where('question_key', $key)->firstOrFail();