app/Http/Controllers/QuestionController.php

select * from `questions` where `questions`.`deleted_at` is null order by `level_id` asc, `type_id` asc, `question_english` asc limit 20 offset 0
select `id`, `level_name` from `levels` where `levels`.`id` in (4) and `levels`.`deleted_at` is null
select `id`, `type_name` from `types` where `types`.`id` in (1) and `types`.`deleted_at` is null
select count(*) as aggregate from `questions` where `questions`.`deleted_at` is null
---
    public function index($rspMsg = null, $filter = null)
    {
        //$questions = Question::all()->loadMissing('level:id,level_name', 'type:id,type_name', 'createdBy:id,name')->sortBy([['level_id', 'asc'], ['updated_at', 'desc']]);
        $questions = Question::with('level:id,level_name', 'type:id,type_name', 'createdBy:id,name')->orderBy('level_id')->orderBy('type_id')->orderBy('question_english')->paginate(20);

select count(*) as aggregate from `questions` where `id` != 359 and `deleted_at` is null and `level_id` = '4' and `type_id` = '1' and `question_english` = 'Animi quis repellendus accusamus' and `questions`.`deleted_at` is null
update `questions` set `question_english` = 'Animi quis repellendus accusamus', `questions`.`updated_at` = '2023-08-28 15:42:16' where `id` = 359
---
    public function store(Request $request)
    {
        //dd($request);
        try {
            $id = decrypt($request->id);
            // //Logic test
            $cek = Question::where('id', '!=', $id)->where('deleted_at', null)->where('level_id', $request->level_id)->where('type_id', $request->type_id)->where('question_english', $request->question_english)->count();
            if ($cek > 0) {
                throw new Exception('Question already exists');
            }

            $request->validate([
                'level_id' => 'required',
                'type_id' => 'required',
                'question_english' => 'required',
            ]);

            $request->merge(['created_by' => auth()->user()->id]);
            Question::updateOrCreate(
                ['id' => $id],
                $request->all(),
            );

select * from `questions` where `questions`.`id` = '163' and `questions`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        if ($id == null) {
            return abort(400);
        }

        $obj = Question::find($id);

update `questions` set `deleted_at` = '2023-09-01 21:43:02', `questions`.`updated_at` = '2023-09-01 21:43:02' where `id` = 186
---
    public function destroy($id)
    {
        if ($id == null) {
            return abort(400);
        }
        $obj = Question::find($id);
        $obj->delete();

select * from `types` where `types`.`deleted_at` is null
---
    private function getAllType()
    {
        return Type::all();