app/Http/Controllers/TypeController.php

select * from `types` where `types`.`deleted_at` is null
---
    public function index()
    {
        $types = Type::all();

select * from `types` where `types`.`id` = '1' and `types`.`deleted_at` is null limit 1
---
    public function destroy($id)
    {
        if ($id == null) {
            return abort(400);
        }
        $obj = Type::find($id);